Courses/7140/Projects/note20170318.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>CS7140 Spring 2017 Project pdfRenamer Logistics</title>
<!-- 2017-03-20 Mon 14:50 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="CEG7380 Cloud Computing"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
2017-03-18 | <a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">CS7140 Spring 2017 Project pdfRenamer Logistics</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Status as of Sat March 18, 2017</a>
<ul>
<li><a href="#sec-1-1">1.1. Links</a></li>
<li><a href="#sec-1-2">1.2. Test PDFs</a></li>
<li><a href="#sec-1-3">1.3. Requirements</a></li>
<li><a href="#sec-1-4">1.4. Reviews of Requirements</a></li>
</ul>
</li>
<li><a href="#sec-2">2. By The Final Week</a></li>
<li><a href="#sec-3">3. The Next Few Weeks</a>
<ul>
<li><a href="#sec-3-1">3.1. Specification</a></li>
<li><a href="#sec-3-2">3.2. Suggested Work</a></li>
</ul>
</li>
<li><a href="#sec-4">4. End</a></li>
</ul>
</div>
</div>
<p>
Let us name the primary piece of software resulting from this project
as <code>pdfrenamer</code>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Status as of Sat March 18, 2017</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Links</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Apoorva <a href="https://github.com/apoorvavinod/AdvancedSoftwareEngineering">https://github.com/apoorvavinod/AdvancedSoftwareEngineering</a>
</li>
<li>Jayant  <a href="https://github.com/jayanthanantharaman/AdvanceSoftwareEngineering">https://github.com/jayanthanantharaman/AdvanceSoftwareEngineering</a> 
</li>
<li>Jonathan <a href="https://github.com/MasterGeese/CS7140/tree/master">https://github.com/MasterGeese/CS7140/tree/master</a> 
</li>
<li>Sarker <a href="https://github.com/md-k-sarker/PDF-Renamer/">https://github.com/md-k-sarker/PDF-Renamer/</a>
</li>
<li>Stephanie <a href="https://github.com/sbelow1/PDFRenamer.git">https://github.com/sbelow1/PDFRenamer.git</a> 
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Test PDFs</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>I asked each of you to contribute 5 test PDFs.
</li>
<li>Done, but they are not all on GitHub.  Why not??
</li>
<li>They are not annotated, showing fields of interest.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Requirements</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>Both teams have submitted.  Below are the links.
</li>
<li><a href="https://github.com/MasterGeese/CS7140/blob/master/Requirements.pdf">Jonathan + Sarker</a>
</li>
<li><a href="https://github.com/md-k-sarker/PDF-Renamer/blob/master/Requirement/Requirements_v0.0.4_team_of_3.pdf">Apoorva + Jayant + Sarker</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Reviews of Requirements</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>Each student reviewed the Req Doc of the other team.
</li>
<li>Five reviews done.  Quite "reasonable" reviews.
</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> By The Final Week</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Previous Reports: (i) Requirements, (ii) Specifications, (iii) Design,
(iv) Implementation, (v) Testing.
</li>

<li>The final report for the project is essentially an assembly of all
the previous reports, which now become chapters, revised if
necessary.  This is the 6th report.
</li>

<li>Crucial are the Final Report, and the demonstrable piece of
software: <code>pdfrenamer</code>.
</li>

<li>All six reports are to be submitted. As I said several times, due
dates can be negotiated &#x2013; but, not beyond the end of term.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> The Next Few Weeks</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>The next milestone is the specification.
</li>
<li>We discussed what Domain Analysis is, and why we do it.  For our
project, is it clear enough in your thinking?  Are you familiar
enough with the PDF libraries?  Can you name the
PDF-extraction-operations mnemonically?  Are you ready to
rigorously (even without math and logic) specify?  If you could,
that would make the core of the Spec Doc.
</li>
</ol>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Specification</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>My assessment on Mar 15 was that you are not ready to do Specs.
But, I did not say so in class.  Instead, I gave a constructive
suggestion.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Suggested Work</h3>
<div class="outline-text-3" id="text-3-2">
<ol class="org-ol">
<li>Combine the two Requirements Docs into one, benefiting from the
reviews.  Also, include domain analysis.  Let us call this RDv2.
Use RDv2 as the basis for remaining work.
</li>

<li>Intuitive discussion of domain analyses is necessary, but not
sufficient.  Develop "trial" implementations of the
PDF-extraction-operations.  This will constitute neither a Spec nor
a Design.  
</li>

<li>I hope to discuss Test Driven Development (TDD) and Agile
Development soon.  These are relevant to the above.
</li>

<li>Write a TR documenting the above effort.  I did not give a name to
this TR.  I said [something to the effect that] submit this instead
of Specs.
</li>

<li>The due date was Mar 17, which was extended to Mar 18.  I am
composing this note around 9:00 PM.  So, the due date of Mar 18
11:59 PM does not seem feasible.  Which is OK.  You come up with a
due date, and we discuss this quickly on Mar 20.  Obviously, the
due date of Mar 18 is dropped.
</li>
</ol>
</div>
</div>
</div>



<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> End</h2>
<div class="outline-text-2" id="text-4">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2017 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2017-03-18
</div>
</body>
</html>
